{"reviewerID": "A1N4O8VOJZTDVB", "asin": "B004A9SDD8", "reviewerName": "Annette Yancey", "helpful": [1, 1], "reviewText": "Loves the song, so he really couldn't wait to play this. A little less interesting for him so he doesn't play long, but he is almost 3 and likes to play the older games, but really cute for a younger child.", "overall": 3.0, "summary": "Really cute", "unixReviewTime": 1383350400, "reviewTime": "11 2, 2013"}
{"reviewerID": "A2HQWU6HUKIEC7", "asin": "B004A9SDD8", "reviewerName": "Audiobook lover \"Kathy\"", "helpful": [0, 0], "reviewText": "Oh, how my little grandson loves this app. He's always asking for \"Monkey.\" Grandma has tired of it long before he has. Finding the items on each page that he can touch and activate is endlessly entertaining for him, at least for now. Well worth the $.99.", "overall": 5.0, "summary": "2-year-old loves it", "unixReviewTime": 1323043200, "reviewTime": "12 5, 2011"}
{"reviewerID": "A1SXASF6GYG96I", "asin": "B004A9SDD8", "reviewerName": "Barbara Gibbs", "helpful": [0, 0], "reviewText": "I found this at a perfect time since my daughter's favorite song at the moment is five little monkeys. It's easy for little ones to operate and fun with all the things you can play with. The different generes are nice too, gives its a little variety.  Worth the money. Highly recommended!", "overall": 5.0, "summary": "Fun game", "unixReviewTime": 1337558400, "reviewTime": "05 21, 2012"}
{"reviewerID": "A2B54P9ZDYH167", "asin": "B004A9SDD8", "reviewerName": "Brooke Greenstreet \"Babylove\"", "helpful": [3, 4], "reviewText": "My 1 year old goes back to this game over and over again.  It is simple but very easy for a toddler to use.  I've even caught my 5 year old playing it as well.  Good app for little guys!", "overall": 5.0, "summary": "We love our Monkeys!", "unixReviewTime": 1354752000, "reviewTime": "12 6, 2012"}
{"reviewerID": "AFOFZDTX5UC6D", "asin": "B004A9SDD8", "reviewerName": "C. Galindo", "helpful": [1, 1], "reviewText": "There are three different versions of the song. The game itself keeps her occupied as everything she clicks on does something! There is an airplane that flies around the room, a telephone that rings and is plays a message, the lamp turns off the light and you see the monkeys eyes going up and down in the dark, a dog that barks when you click the window and then chases a cat out from under the bed every third time, the picture on the wall becomes an interactive portrait, the traffic light stops/starts the monkeys jumping, alarm clock rings, plant grows (and produces bananas), ball bounces, toy truck rumbles and honks.... lots to keep a toddler occupied! Oh! The monkeys jump on and fall off the bed! Mama calls the doctor, etc! It's great.", "overall": 5.0, "summary": "This is my granddaughters favorite app on my Kindle!", "unixReviewTime": 1391212800, "reviewTime": "02 1, 2014"}
{"reviewerID": "A331GYAT4ESYI3", "asin": "B004A9SDD8", "reviewerName": "Felicia", "helpful": [3, 3], "reviewText": "THis is just so cute and a great app for little ones. My 16 mo old loves it. She thinks it's so funny and gets a kick out of the song.", "overall": 5.0, "summary": "so cute", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}
{"reviewerID": "A2YEHF8T823TDC", "asin": "B004A9SDD8", "reviewerName": "Gale White Miller", "helpful": [3, 4], "reviewText": "I watch my great grandson 4 days a week and it's hard to keep a 16 month old occupied but all I have to do is turn on Five Little Monkeys and he goes crazy trying to get the monkey's off the bed and touching all the other interactive things on the screen. I love this! I absolutely recommend this!", "overall": 5.0, "summary": "Terrific!", "unixReviewTime": 1381708800, "reviewTime": "10 14, 2013"}
{"reviewerID": "A3699WHISXX94Z", "asin": "B004A9SDD8", "reviewerName": "Janie Leonard", "helpful": [0, 0], "reviewText": "This app is wild and crazy.  Little ones love singing the song about Five Little Monkeys, in this app it is available in country, rock or pop.  It is full of action with the player controlling most of it but it has a lesson included.", "overall": 5.0, "summary": "Five Little Monkeys", "unixReviewTime": 1389484800, "reviewTime": "01 12, 2014"}
{"reviewerID": "A2BXV49EIES2TB", "asin": "B004A9SDD8", "reviewerName": "Kayla", "helpful": [3, 4], "reviewText": "love love love this app. I was going through different apps for my son and I came across this one and I was excited and singing along to the song, only problem is that the song is very quite", "overall": 5.0, "summary": "love but to quite", "unixReviewTime": 1386720000, "reviewTime": "12 11, 2013"}
{"reviewerID": "A37HM5TMCMHJES", "asin": "B004A9SDD8", "reviewerName": "kmc", "helpful": [0, 0], "reviewText": "Very cute, with alot of items to move about.  Would be awesome if the &#34;dr. said&#34;  was in a different voice and moved too.", "overall": 5.0, "summary": "Cute", "unixReviewTime": 1366934400, "reviewTime": "04 26, 2013"}
{"reviewerID": "A1FYZPJLU78R2Y", "asin": "B004A9SDD8", "reviewerName": "Linda Gibbons", "helpful": [1, 2], "reviewText": "WELL THE CHILDREN LOVE IT AFTER AWHILE YOU GET TIERD OF IT BUT AS LONG AS THE GRANDCHILDREN LIKE IT YOU LISTEN TO IT", "overall": 4.0, "summary": "MONKEYS", "unixReviewTime": 1374105600, "reviewTime": "07 18, 2013"}
{"reviewerID": "AV58L39SOERMI", "asin": "B004A9SDD8", "reviewerName": "LP", "helpful": [1, 2], "reviewText": "I got this app because my 2 year old daughter loves the song. I found that the audio could have been clearer. They also could have had better or more tune options, they only offered 'rock', country', and 'pop', which I thought were horrible for this children's song. I do like that it's interactive. Everything you touch in the room does something different. Phone rings, dog chases the cat, door opens, clock goes off, etc.....neat. My daughter also enjoys all the other interactive features it has other than the monkeys falling off the bed. &#34;Wheels on the bus&#34; app by &#34;duck duck moose&#34; ranks higher because you have much more options like changing the language, gender voice options, instrumental, and self record which my daughter finds hilarious when she hears her own voice.  Overall it's ok and she likes to see the monkeys fall off the bed.", "overall": 3.0, "summary": "Could be better....", "unixReviewTime": 1373241600, "reviewTime": "07 8, 2013"}
{"reviewerID": "A31XG60B64OW74", "asin": "B004A9SDD8", "reviewerName": "Melissa Boysen", "helpful": [3, 4], "reviewText": "My three year old Plays this game the most he loves being able to touch all the different things and watch what happens. Keeps him busy for hours", "overall": 5.0, "summary": "Five little monkeys", "unixReviewTime": 1368576000, "reviewTime": "05 15, 2013"}
{"reviewerID": "A39JZ61LPIVY91", "asin": "B004A9SDD8", "reviewerName": "Mimi", "helpful": [1, 2], "reviewText": "Good for little ones, especially if  know the nursery rhyme.  Once you show them what to click on they pick it up fast.", "overall": 3.0, "summary": "Good for small children", "unixReviewTime": 1367539200, "reviewTime": "05 3, 2013"}
{"reviewerID": "AIRKROQMCBVG4", "asin": "B004A9SDD8", "reviewerName": "NINA WHEELER", "helpful": [3, 3], "reviewText": "My two year old grandson loves this game and plays it constantly !!  Keeps him busy for quite some time.", "overall": 5.0, "summary": "Fun, fun, fun !!", "unixReviewTime": 1385942400, "reviewTime": "12 2, 2013"}
{"reviewerID": "AELVL0VXR3VFN", "asin": "B004A9SDD8", "reviewerName": "PClark", "helpful": [2, 2], "reviewText": "My granddaughter really loves this. She will listen to all 3 types of music with it and is not yet tired of it.", "overall": 5.0, "summary": "So cute", "unixReviewTime": 1353196800, "reviewTime": "11 18, 2012"}
{"reviewerID": "A55641MA1CS5F", "asin": "B004A9SDD8", "reviewerName": "Robert Daniels", "helpful": [1, 1], "reviewText": "love it, but wish it was fullscreen on honeycomb. the songs and animations are quite catchy. great for any preschool teacher or parent of you guns.", "overall": 4.0, "summary": "love it", "unixReviewTime": 1313280000, "reviewTime": "08 14, 2011"}
{"reviewerID": "A39TLD5D8M76M4", "asin": "B004AFQAUA", "helpful": [0, 0], "reviewText": "does not let you sample only for a sec. if you download  it to computer it talk your music you have try to sell it back to too. if you join with a membership and if you don't pay they  sell your music on your computer . how when you combine your to there player . i know cause the did it to me had rhapsody a long time unit  it happen i close the account . don't mine paying. but not for music i have  before that . had the old look . at the time now it worse", "overall": 1.0, "summary": "dont play there", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "A2XJJKZSEYYW8T", "asin": "B004AFQAUA", "reviewerName": "A Customer", "helpful": [0, 0], "reviewText": "this is a very good app and it you need this service then this is the app for you to enjoy.", "overall": 5.0, "summary": "app", "unixReviewTime": 1394064000, "reviewTime": "03 6, 2014"}
{"reviewerID": "AJ9JRKE8AADW0", "asin": "B004AFQAUA", "reviewerName": "Allison Janezic", "helpful": [1, 1], "reviewText": "It's easy to use and transfer songs. If I purchase songs I usually use iTunes but Rhapsody allows me to get songs and listen to them before I purchase them. However, some albums are only allowed to be purchased which I find annoying. I think they need to allow subscribers to get them for the fee. After all we can not keep them if we are not subscribers.", "overall": 4.0, "summary": "Worth the monthly fee", "unixReviewTime": 1363478400, "reviewTime": "03 17, 2013"}
{"reviewerID": "A3ACPKNYVFJWRY", "asin": "B004AFQAUA", "reviewerName": "Altaira_Jade", "helpful": [1, 1], "reviewText": "Great selections.  Easy to use interface.  I have playlists for everyone in the family (me, hubby, and 10 year old son).  Works great on the PC and my MP3 players (no Apple products tested).  Also use with Sonos and that interface is also simple to use.Only complaint is that you can't customize your plan.  I want 2 MP3 players and I'd have to pay for 3.  It's an extra $70 a year.  I would only pay $2 a month for the second player, so I got a huge capacity MP3 and share.  Easy to do with playlists.", "overall": 4.0, "summary": "Great service", "unixReviewTime": 1354060800, "reviewTime": "11 28, 2012"}
{"reviewerID": "A2ETSATXP9MTZ6", "asin": "B004AFQAUA", "reviewerName": "Amazon Customer", "helpful": [1, 1], "reviewText": "I really don't think I could live without Rhapsody. I have it on my phone, my computer and my Kindle Fire. I use it everyday, no matter what device it is on, it works great. It is a wonderful way to take your favorite music and playlists with you wherever you go, whatever you do. Be aware that you do have to have a subscription and I'm pretty sure the price can range from $10 and up per month.", "overall": 5.0, "summary": "I love Rhapsody", "unixReviewTime": 1358553600, "reviewTime": "01 19, 2013"}
{"reviewerID": "A3RYB7MYE6C8CB", "asin": "B004AFQAUA", "reviewerName": "Amazon Customer \"I am 62 yrs. old....I love t...", "helpful": [8, 10], "reviewText": "I love this app!! Yes,after 14 days you have to pay $9.99 a month....but this app has helped keep my sanity. It is the first app that Amazon has put out for music that I have liked. I  have tried over 100 apps. from Amazon and they asked for my opinion....here it is.Rhaspody has an extremely large array of music.I had no problem finding all the different artists and albums that I love. You can even download music to play off- line . I can listen to my music all day and night long.Please get this app....you,ll love it!", "overall": 5.0, "summary": "Rhaspody", "unixReviewTime": 1343260800, "reviewTime": "07 26, 2012"}
{"reviewerID": "A17YPB3JICRUK2", "asin": "B004AFQAUA", "reviewerName": "Amazon Customer \"StormyJ\"", "helpful": [0, 1], "reviewText": "If you pay for the subscription then by all meens get this App. It works well and  I love the service. I have a family of 4 and we all use it under one price.", "overall": 5.0, "summary": "Rhapsody", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}
{"reviewerID": "A3SZDQ4JQH7T9S", "asin": "B004AFQAUA", "reviewerName": "Amy", "helpful": [1, 3], "reviewText": "Tried to run this on my Kindle Fire; kept giving me message that I needed an updated flash player. When I tried to download, there were several selections, but none seemed to match my Kindle Fire settings and the ones I tried to download, didn't make Rhapsody work either. There seemed to be two ways to access Rhapsody; one took me to all this problem of the download and the other was the pay for it monthly option. I deleted all the downloads & Rhapsody app off my Kindle.", "overall": 1.0, "summary": "Very disappointed", "unixReviewTime": 1358035200, "reviewTime": "01 13, 2013"}
{"reviewerID": "A28HK5XEA7B1K1", "asin": "B004AFQAUA", "reviewerName": "Anna Bernyc \"Snow White (Book Angels12)\"", "helpful": [2, 2], "reviewText": "We love Rhapsody we use it all the time. Affordable and we can have it on 3 devices at once. We are so done wasting money on our itunes acct.5 stars all the way", "overall": 5.0, "summary": "Amazing", "unixReviewTime": 1374969600, "reviewTime": "07 28, 2013"}
{"reviewerID": "AAGR17G2JXJLT", "asin": "B004AFQAUA", "reviewerName": "Annette L. Goldis", "helpful": [2, 5], "reviewText": "It just doesn't do what I needed it to do.  For someone else maybe, but I get lost in my own house LOL.", "overall": 1.0, "summary": "Didn't do", "unixReviewTime": 1372204800, "reviewTime": "06 26, 2013"}
{"reviewerID": "AG6A7QDC8L9R", "asin": "B004AFQAUA", "reviewerName": "Brian F", "helpful": [0, 0], "reviewText": "I Have to Say that of All of the Many Other Music Player Apps.Around,(This 1 has the Best Overall Selection of All)!!!If you like Obscure Stuff Especially!!!!", "overall": 5.0, "summary": "Maybe Best Overall Selection!!!", "unixReviewTime": 1389571200, "reviewTime": "01 13, 2014"}
{"reviewerID": "A3S6DO7HX3YVMQ", "asin": "B004AFQAUA", "reviewerName": "BrianJ", "helpful": [3, 3], "reviewText": "I have been a Rhapsody susbscriber for many years.  The service has been reliable and a good value, but the latest smartphone and tablet apps take it to a new level.  The UI is much improved, intuative, and brings recommendations and new releases once available only on the desktop software.  Good work!", "overall": 5.0, "summary": "Wow - V 3 rocks!", "unixReviewTime": 1352160000, "reviewTime": "11 6, 2012"}
{"reviewerID": "A1UTFW6LO2I0DR", "asin": "B004AFQAUA", "reviewerName": "Casey", "helpful": [1, 1], "reviewText": "I have used most every subscription music service and when it comes to their apps, Rhapsody's offers one of the best experiences. While Spotify revolves heavily around playlists and radio, Rhapsody has both and a whole lot more. It is much easier to navigate and find the music you are looking for and it includes easy access to your saved music library. Plus you can download individual tracks, albums, and playlists for offline play. Both the interface and visual appearance are very nice. The sound quality tops out at 192 kbps AAC+, which is not as high as some services, but sounds great from my experience. There is a lower setting if you need to save data usage. Any song in their library can be listened to on-demand (or as part of a playlist or radio station) through their app. All ad-free.The service itself requires a subscription, currently $10 per month. While they do have free trials, they do not currently have a free version of the service. So if you are not interested in subscribing or giving it a trial run, then this app is probably not for you.I use this app on my first generation Kindle Fire and so far no complaints.", "overall": 5.0, "summary": "Great Music App", "unixReviewTime": 1387411200, "reviewTime": "12 19, 2013"}
{"reviewerID": "A11HCFWG0NRQY6", "asin": "B004AFQAUA", "reviewerName": "Cordelia Starnes", "helpful": [1, 1], "reviewText": "I have been a therapist fan for years. it' s a great product. download as many songs as you want each month. super quick and easy. affordable.", "overall": 5.0, "summary": "Great Product", "unixReviewTime": 1356739200, "reviewTime": "12 29, 2012"}
{"reviewerID": "AK3IFCDU88TI9", "asin": "B004AFQAUA", "reviewerName": "C. Riostirado", "helpful": [2, 2], "reviewText": "I love my rhapsody!! I was so glad that I could get it on my kindle for my daughter!! I have had Rhapsody since it was Napster...love that it is a device that we can use it on!", "overall": 4.0, "summary": "Love it!", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "A39SUI22Z4O4BM", "asin": "B004AFQAUA", "reviewerName": "dianabeld", "helpful": [0, 0], "reviewText": "this app I do not use. and not sure how to get rid of it so I am stuck with it", "overall": 5.0, "summary": "rapsody", "unixReviewTime": 1359158400, "reviewTime": "01 26, 2013"}
{"reviewerID": "A2QXWOJN2NV3Z7", "asin": "B004AFQAUA", "reviewerName": "dmlasp", "helpful": [15, 20], "reviewText": "I did the 7-day trial and was impressed, but am continuing my search for the best music app. Pros: tons of selection (but every music app has that); my account worked on the phone and online (at least for the trial; not sure if that applies afterwards); download to play off-line (while you have the service, obviously); decent UI (I made the buttons larger for in-car use); decent arrangement of genres with descriptions, key artists, key albums, key songs; info about artists is reasonably detailed; radio stations (though lots of music apps have those); tracking of songs played (though that seemed to be online only); recommendations are ok. Cons: songs did lots of skipping/jumping, even when I had 4 bars & 4G, and even online (though songs sometimes continued when coverage was bad); lacks the customization of thumbs up/down that I grew used to in Pandora; playlist UI isn't helpful - it shows a big view of the album of the currently playing song, then the list rolls of the screen, with no view of the upcoming song (you have to scroll all the way down the list); no lockscreen control; online there doesn't appear to be a way to create shortcuts to favorite radio stations; no scrobbling (there are some 3d party programs for online use). Will continue checking out Pandora, Tunewiki (really like the sync'd lyrics, when it works), Slacker, Winamp, Rdio, etc.", "overall": 3.0, "summary": "Good functions, but so many others do this and more", "unixReviewTime": 1307491200, "reviewTime": "06 8, 2011"}
{"reviewerID": "A3K1MGK7GNGC35", "asin": "B004AFQAUA", "reviewerName": "drummerj80", "helpful": [1, 1], "reviewText": "I use this app so much at work and at home. Just find my favorite artist of the day and play their music while I work!", "overall": 5.0, "summary": "My music source!", "unixReviewTime": 1358985600, "reviewTime": "01 24, 2013"}
{"reviewerID": "A2HC94KQKVGIA1", "asin": "B004AFQAUA", "reviewerName": "D. Stephens", "helpful": [2, 3], "reviewText": "Rhapsody is great if you like \"All you can Eat\" music..  There are a lot of music programs and services out there now but I always come back to Rhapsody for a couple reasons.1.) I love their desktop app!!2.) I love being able to use the service with a REAL mp3 player, not just an android phone or ipod touch/iphone.  With the desktop app, the service works with Sandisk MP3 Players (Most are supported but check rhapsody before you purchase one)Now for this app.  The app on android and Kindle is great.  It gives you access, not just to their radio feature, but also to their \"all you can eat\" music service.  You can download the tracks to your phone for free (As long as you keep paying the monthly fee, these songs stay active\".  Their \"radio\" feature is great if you like services like Pandora.  The Rhapsody radio doesn't have the ads like Pandora and other free radio services.  The radio feature is also very smart just like Pandora (Though I would say it is not as smart as Pandora).Overall this is a great app if you like music and like being able to choose what songs you want to listen to or if you wanna listen to an entire album!!  And the app doesn't bog the phone down with adds or video adds like Pandora!Try it for a month!! Most new phones and kindles will give you a free trial! If not you can use this link for one.. I was one over with the free trial I received when I downloaded this app to my Kindle[...]", "overall": 5.0, "summary": "Great App for, Kindle or Phone", "unixReviewTime": 1375401600, "reviewTime": "08 2, 2013"}
{"reviewerID": "A18G4LXVA8E57D", "asin": "B004AFQAUA", "reviewerName": "Emelia Engleman", "helpful": [4, 4], "reviewText": "Awesome choice of music, but I can't have my kindle and my phone signed up together, even though you can have up to 3 computers, which sucks. And I can't find the music I've downloaded anywhere in my device.", "overall": 4.0, "summary": "can't find my downloads but had every album ever!", "unixReviewTime": 1373846400, "reviewTime": "07 15, 2013"}
{"reviewerID": "AZN94X9HSS594", "asin": "B004AFQAUA", "reviewerName": "Filmguy", "helpful": [0, 0], "reviewText": "It allows me to access Rhapsody on my Kindle which I would not be able to do without the app.", "overall": 5.0, "summary": "It works", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A3DW3YFVVAWDSW", "asin": "B004AFQAUA", "reviewerName": "Frequent Amazon Shopper", "helpful": [2, 3], "reviewText": "I have been a subscriber to Rhapsody for more than 5 years.  The selection of music in the genres that I like to choose from is adequate...nothing great!!!  I only stay with them because I need to update the license every 30 days or so in order to listen to the music I have downloaded to my MP3 player.  But I am giving serious consideration to going to an alternative music source.  Reason you asked...the software is very &#34;unstable&#34; in my opinion.  It frequently locks up at the most inopportune times.  Obviously, this requires restarting the software program and reloading what I had already begun.  It happens so often, that it has become a pain in the backside.At this point, I would not be strongly recommending Rhapsody to others.", "overall": 3.0, "summary": "Long Time Subscriber", "unixReviewTime": 1377820800, "reviewTime": "08 30, 2013"}
{"reviewerID": "A1CSAU5Q1UZI85", "asin": "B004AFQAUA", "reviewerName": "gemigirl68", "helpful": [1, 1], "reviewText": "I love rhapsody. I always used it to listen to music or find new songs to download on my devices.", "overall": 5.0, "summary": "I love it", "unixReviewTime": 1363737600, "reviewTime": "03 20, 2013"}
{"reviewerID": "A31Q2IJFLNTTWT", "asin": "B004AFQAUA", "reviewerName": "H. Johnson", "helpful": [0, 1], "reviewText": "Apparently my home subscription of Real Player wasn't good enough to stream on my Android device.  Required subscription upgrade (similar to Sirius/XM)", "overall": 2.0, "summary": "Subscription player", "unixReviewTime": 1318377600, "reviewTime": "10 12, 2011"}
{"reviewerID": "A27H3Z4H4SMD1X", "asin": "B004AFQAUA", "reviewerName": "Huntrr7", "helpful": [5, 8], "reviewText": "You cant use this unless you have a PAID account. and if you do, it can only go to 3 computers/kindles (whatever). anymore you will exceed your limit. THIS STINKS", "overall": 1.0, "summary": "You cant even use it!", "unixReviewTime": 1355270400, "reviewTime": "12 12, 2012"}
{"reviewerID": "A2PI8FRSA5Z9C5", "asin": "B004AFQAUA", "reviewerName": "James Maloney", "helpful": [0, 1], "reviewText": "I love it, it works great as a mobile radio app. I've been able to use Rhapsody for a year and the product and app are defiantly recommended.", "overall": 4.0, "summary": "Great app for Rhapsody users", "unixReviewTime": 1355356800, "reviewTime": "12 13, 2012"}
{"reviewerID": "AD0AO0OQP4X9P", "asin": "B004AFQAUA", "reviewerName": "J. Bowling", "helpful": [0, 1], "reviewText": "Ipad and Ipod Touch versions are much better. App can be hard to navigate at times and seems more like a mobile site than a convenient app.", "overall": 3.0, "summary": "Needs Improvement", "unixReviewTime": 1356739200, "reviewTime": "12 29, 2012"}
{"reviewerID": "A2AMY0OOGMZHW5", "asin": "B004AFQAUA", "reviewerName": "jdel97", "helpful": [1, 6], "reviewText": "why would you want to get a free app and but then have to pay 10 bucks a month to use it?", "overall": 1.0, "summary": "i dont get it", "unixReviewTime": 1333065600, "reviewTime": "03 30, 2012"}
{"reviewerID": "AC2WXL4UEMNW0", "asin": "B004AFQAUA", "reviewerName": "Jennifer", "helpful": [0, 1], "reviewText": "No matter what kind of music I want to listen to, its there! I even get a guided meditations anytime I want! Its unlimited!", "overall": 5.0, "summary": "music to my mood!", "unixReviewTime": 1364515200, "reviewTime": "03 29, 2013"}
{"reviewerID": "AUPCERMZ6ASML", "asin": "B004AFQAUA", "reviewerName": "JK", "helpful": [2, 2], "reviewText": "I love Rhapsody but it costs additionally a monthly fee in order to use your rhapsody account on an android tablet. Unless you are constantly on your tablet I don't think this is worth the cost.", "overall": 3.0, "summary": "Additional Cost involved with Rhapsody", "unixReviewTime": 1372636800, "reviewTime": "07 1, 2013"}
{"reviewerID": "A1LHJ32NVLJ5QS", "asin": "B004AFQAUA", "reviewerName": "jodystaf", "helpful": [4, 5], "reviewText": "You have to go onto a computer to sign up. Well I don't own a computer!Make it so you can sign up in the app", "overall": 2.0, "summary": "why", "unixReviewTime": 1364515200, "reviewTime": "03 29, 2013"}
{"reviewerID": "A2EB1CJNA7Y194", "asin": "B004AFQAUA", "reviewerName": "kathy", "helpful": [2, 5], "reviewText": "wanted to find a music app that was free this one was not and was way too much money for what I was looking for.", "overall": 1.0, "summary": "don't waste your money", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}
{"reviewerID": "A1XDCE3MFNX9TN", "asin": "B004AFQAUA", "reviewerName": "Leonard L. Volk", "helpful": [1, 1], "reviewText": "I had Rhapsody acct. on my computer before I bought my Kindle Fire.  It os very easy to use to find songs, vocal groups, or genres of music and the dowhloads are fast and easy to transfer to mp3 players or the Kindle Fire.", "overall": 5.0, "summary": "easy to use", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}
{"reviewerID": "A35U1NNA7TL9HM", "asin": "B004AFQAUA", "reviewerName": "Margaret Ventresca", "helpful": [0, 0], "reviewText": "Greatest hits and win the strength slots with Elvis Presley slots are greatest so much a hit with slotomania. So keep it the higher rating.", "overall": 5.0, "summary": "cool", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"}
{"reviewerID": "A42A5GQ9G0POX", "asin": "B004AFQAUA", "reviewerName": "mark stumpo", "helpful": [0, 0], "reviewText": "Have been using it for years, millions of choices to choose from.  Easy program interface to use.  Audio quality is great.", "overall": 5.0, "summary": "Great music program", "unixReviewTime": 1381622400, "reviewTime": "10 13, 2013"}
{"reviewerID": "A2ULTURZ2X0CIN", "asin": "B004AFQAUA", "reviewerName": "Martha L. Rios Hernandez", "helpful": [1, 2], "reviewText": "is the music I like, non-commercial, so I recommend it, every day my daughters and I heard music, they doing their homework and I cleaning my house and the songs are our inspiraton, thank you", "overall": 5.0, "summary": "excellent music &lt;3", "unixReviewTime": 1379116800, "reviewTime": "09 14, 2013"}
{"reviewerID": "A1HW31KJ9V89CR", "asin": "B004AFQAUA", "reviewerName": "Mary Ann Winstead", "helpful": [0, 0], "reviewText": "Love that I can type any song in and it comes up quick. Better than Pandora.", "overall": 5.0, "summary": "rhapsody", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"}
{"reviewerID": "A2TOL9QN6PKOWE", "asin": "B004AFQAUA", "reviewerName": "Marylin Hall \"My Melody\"", "helpful": [1, 1], "reviewText": "I had Napster before it changed to Rhapsody. I love Napster. being to listen to any music genre I'm in the mood for no matter where I am.I would recommend this product to anyone who likes music. The monthly plans are also very reasonable.", "overall": 5.0, "summary": "Love this", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}
{"reviewerID": "A39Z5FLKY617LZ", "asin": "B004AFQAUA", "reviewerName": "Mike Charles", "helpful": [0, 0], "reviewText": "I happen to like the country genre, and the music sounds are unbeatable! I believe this would true with any genre that you  might like!", "overall": 5.0, "summary": "Awesome music!", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A1VO5Y77J1PKAE", "asin": "B004AFQAUA", "reviewerName": "M. McGinnis", "helpful": [0, 1], "reviewText": "If only the software was better.As said, the service is amazing.  Competitors like Zune and Qriocity don't have a library anywhere near as deep as Rhapsody's.  But Rhapsody front ends on the Droid and the PC are sub-par.  The latest app update is better than the previous, but its still butt-ugly, and getting around feels harder than it needs to be.  They've added hi-def streaming to the latest version, and it sounds great.  A track still occassionaly drops, but I'm getting fewer of them now.Someone said that you need a higher priced subscription to use the PC software.  This isn't true, my 9.99/month subscription allows me to use the software on one mobile device and 3 PC's.But as far as the PC software goes, its simply awful.  Its supposed to handle downloads and transfers to your mobile device for offline listening, but I can't get it to work properly with my phone.  Its also hideously ugly (think old school Itunes).  Windows doesn't look like apple, so don't make an app that poorly emulates the look of an app that's already ugly.Great service...just wish they'd write better software, and hire someone who wasn't colorblind to build the interfaces.  Black and blue and gray...no real polish.Easy 5-stars if they bring their interfaces into the modern age, and make the PC version work right.  I've figured out how to download stuff to my phone for offline listening without the PC client, but a functioning client would make this so much more pleasant.They've released a web beta that looks pretty darn sharp--hoping they'll bring its look and feel down to the PC and Android soon and move the button/menu options around so I have less mis-taps.", "overall": 3.0, "summary": "If only...", "unixReviewTime": 1308700800, "reviewTime": "06 22, 2011"}
{"reviewerID": "ASHRHGXMGS6I5", "asin": "B004AFQAUA", "reviewerName": "Morgen", "helpful": [0, 1], "reviewText": "I got a new Kindle and quickly started downloading a bunch of apps and books.  I downloaded this app and realized it wasn&#8217;t for me.  It bored me very quickly.  I downloaded the important ones from Amazon&#8217;s library and am content with what I have.  Not for me&#8230;but maybe you&#8217;ll like it.", "overall": 3.0, "summary": "It's Okay", "unixReviewTime": 1358294400, "reviewTime": "01 16, 2013"}
{"reviewerID": "A1SDSSRKEV13C7", "asin": "B004AFQAUA", "reviewerName": "Ms. Shon", "helpful": [1, 1], "reviewText": "I like it cause the music can be saved and stored in rhapsody song match and if you have an account with them your music is automatically saved.", "overall": 5.0, "summary": "my preference", "unixReviewTime": 1368662400, "reviewTime": "05 16, 2013"}
{"reviewerID": "A21U1IHMXD0WOU", "asin": "B004AFQAUA", "reviewerName": "PEM", "helpful": [1, 2], "reviewText": "I love Rhapsody and have it on my home computer.  But this AP wanted me to pay for a second membership for it. I deleted it from my kindle", "overall": 1.0, "summary": "Unhappy", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "AU10792LN4C9O", "asin": "B004AFQAUA", "reviewerName": "Pinstripe KING", "helpful": [0, 0], "reviewText": "Excellent source for music if your  willing to pay for the service.  If you're looking for music give it a try, they give you a free trail. If you don't like it you can always look elsewhere.", "overall": 4.0, "summary": "good music", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
{"reviewerID": "A3ASZ2P01CWR75", "asin": "B004AFQAUA", "reviewerName": "Prader \"Praderwilli\"", "helpful": [0, 0], "reviewText": "This app is a widget on Android devices; works as an app on the Fire.  Easy to use, and provide reviews and information about the artists you listen to.", "overall": 4.0, "summary": "Nice interface and user friendly", "unixReviewTime": 1323734400, "reviewTime": "12 13, 2011"}
{"reviewerID": "A3QMDQHBDW2L9Z", "asin": "B004AFQAUA", "reviewerName": "Rachel", "helpful": [0, 1], "reviewText": "Went looking for a app to listen to tunes on my Kindle fire.Tried a few free app,not my cup of tea).Like this 1 cause I don't have to take up a lot of space on my device.", "overall": 5.0, "summary": "tunes on my Kindle Fire", "unixReviewTime": 1356048000, "reviewTime": "12 21, 2012"}
{"reviewerID": "A1VA4TXD90VINO", "asin": "B004AFQAUA", "reviewerName": "Randy Ramirez", "helpful": [0, 0], "reviewText": "This simply is the best app for music. $10 is a great price to get all of your favorite songs classic and modern. Don't go anywhere else. Falsify is the best", "overall": 5.0, "summary": "The Best App for music", "unixReviewTime": 1391299200, "reviewTime": "02 2, 2014"}
{"reviewerID": "A2S6E2EQ2CM7FG", "asin": "B004AFQAUA", "reviewerName": "R", "helpful": [0, 0], "reviewText": "This app was a free trial for a certain amount of time. I used it daily when I downloaded it.  I enjoyed being able to listen to any song I was in the mood for.", "overall": 5.0, "summary": "Liked it", "unixReviewTime": 1394668800, "reviewTime": "03 13, 2014"}
{"reviewerID": "A23ZUZTWTCTLWH", "asin": "B004AFQAUA", "reviewerName": "Rob A.", "helpful": [1, 1], "reviewText": "For those of you who already have a Rhapsody subscription this is a good app to get.  As long as you can connect to the internet you can listen to your music without filling your devices storage space.  The interface is simple to use.  It needs a graphic equalizer and at nothing you can&#8217;t beat the price.", "overall": 3.0, "summary": "If you already have Rhapsody is a good app.", "unixReviewTime": 1357603200, "reviewTime": "01 8, 2013"}
{"reviewerID": "AU37CZS0ND42K", "asin": "B004AFQAUA", "reviewerName": "R. Olson \"Randy2u\"", "helpful": [0, 0], "reviewText": "Works great!  Sign in once and get most of your music at your fingertips!  Not all music is readily available, but most is right there!", "overall": 5.0, "summary": "Nice addition to Rhapsody Account", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"}
{"reviewerID": "A1HQGRBQ86S62S", "asin": "B004AFQAUA", "reviewerName": "Rosebud \"Rose\"", "helpful": [4, 4], "reviewText": "Rhapsody it great to have on your tablet or computer. Great music with famous artists and songs for free and you also can upgrade to avoid ads,but for me  its ok with the ads for free.", "overall": 5.0, "summary": "Great Radio Station", "unixReviewTime": 1377388800, "reviewTime": "08 25, 2013"}
{"reviewerID": "A1CSQ8X7J57Q9K", "asin": "B004AFQAUA", "reviewerName": "Sarah A. Martin", "helpful": [1, 1], "reviewText": "I have used this music source for a number of years and overall, they have a good variety ranging from Jack Hylton to Frank Sinatra to Black Ghosts. The only problem I had is that I had to keep the Caffine app on in order to get more than 30 seconds of a song which I found a little frustrating.  Still, a great way to hear some music from yesteryear and expand on your interests!", "overall": 4.0, "summary": "Decent but......", "unixReviewTime": 1355961600, "reviewTime": "12 20, 2012"}
{"reviewerID": "A3AO0JWK3MRFI7", "asin": "B004AFQAUA", "reviewerName": "SEPepper", "helpful": [0, 1], "reviewText": "I've been using Rhapsody since the former Yahoo Music days.  The app for Kindle works great, just like the apps for the other Android devices.", "overall": 5.0, "summary": "Longtime Rhapsody user", "unixReviewTime": 1369526400, "reviewTime": "05 26, 2013"}
{"reviewerID": "ARZE5N5ZTX6IA", "asin": "B004AFQAUA", "reviewerName": "Shane", "helpful": [2, 4], "reviewText": "I just wanted a music player for what I already own.  This charges you to listen to music that is provided.  Dev needs to be more clear about this.", "overall": 1.0, "summary": "Have to Subscribe", "unixReviewTime": 1370822400, "reviewTime": "06 10, 2013"}
{"reviewerID": "A22544DDR0RCH3", "asin": "B004AFQAUA", "reviewerName": "S. Majocha \"Nursee13\"", "helpful": [0, 1], "reviewText": "I know this app has been out for a while but I just downloaded it.  It's easy to use I just have to remember that I have it on my kindle.  I can get used to it though.  And it's free.", "overall": 4.0, "summary": "Not bad!", "unixReviewTime": 1356739200, "reviewTime": "12 29, 2012"}
{"reviewerID": "A18GP785BTTW43", "asin": "B004AFQAUA", "reviewerName": "Snowfro", "helpful": [0, 0], "reviewText": "We can't get enough of Rhapsody! I play it everyday for the entire house as we work and play. It is amazing!", "overall": 5.0, "summary": "&lt;3 Rhapsody", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}
{"reviewerID": "AP0UZ5VMEHWF5", "asin": "B004AFQAUA", "reviewerName": "S. Suos \"Heat\"", "helpful": [0, 0], "reviewText": "was a Napster subscriber when it joined rhapsody, now can finally use the service on my fire! there was no Napster app for the fire. anyhow,  great interface and music streams nice and clear!", "overall": 5.0, "summary": "great listening on the fire", "unixReviewTime": 1322697600, "reviewTime": "12 1, 2011"}
{"reviewerID": "A9M5E4QA1HR3P", "asin": "B004AFQAUA", "reviewerName": "SuzannefromSC", "helpful": [0, 0], "reviewText": "can download all the songs i like and it is easy as pie!! my son got me interested and am so glad he did. Will continue to use this app!!", "overall": 5.0, "summary": "love it!!", "unixReviewTime": 1366588800, "reviewTime": "04 22, 2013"}
{"reviewerID": "A2H86IUZS1LEH9", "asin": "B004AFQAUA", "reviewerName": "Tamara Moore", "helpful": [0, 0], "reviewText": "Soo much easier than downloading music. I don't care about the 10 bux a month subscription. I get to listen to anything from comedy cd's by kevin hart, wheels on the bus for my son or the first beastie boys cd. It has everything.", "overall": 5.0, "summary": "absolutlely love this app.", "unixReviewTime": 1360627200, "reviewTime": "02 12, 2013"}
{"reviewerID": "A3VY71XCGEN48D", "asin": "B004AFQAUA", "reviewerName": "TONY MARTOCCHIO", "helpful": [1, 1], "reviewText": "I have been a member of Rhapsody now for &#34;years&#34; ! I believe as for a recommondation &#34;years should say it all&#34;", "overall": 5.0, "summary": "MUSIC MUSIC MUSIC !!!", "unixReviewTime": 1362182400, "reviewTime": "03 2, 2013"}
{"reviewerID": "A2EDUKOZI4LTZE", "asin": "B004AFQAUA", "reviewerName": "vanessa", "helpful": [2, 2], "reviewText": "I love Rhapsody especially the updated version. My whole family uses it. We have it on all our gadgets. recommended", "overall": 5.0, "summary": "love", "unixReviewTime": 1373932800, "reviewTime": "07 16, 2013"}
{"reviewerID": "A3RBNX9XVSAUE5", "asin": "B004AFQAUA", "reviewerName": "W. Bradley", "helpful": [0, 1], "reviewText": "This application simply did not work the way I thought it ought to work. When I loaded the app on my device I thought I would be able to load selected tunes from my PC library to this. Instead the app displayed a mind of its own and loaded songs at random. Not at all user friendly.", "overall": 1.0, "summary": "Didn't Work For Me", "unixReviewTime": 1385942400, "reviewTime": "12 2, 2013"}
{"reviewerID": "A3IFPKRBIKDZPX", "asin": "B004AHBBPW", "reviewerName": "Aaron Meeks", "helpful": [0, 0], "reviewText": "This is  a great! It pops up and you can devotions from a number  of people! but nothing is better that The scriptures daily!", "overall": 5.0, "summary": "Love it!", "unixReviewTime": 1353628800, "reviewTime": "11 23, 2012"}
{"reviewerID": "A35JLHWBIR2PVE", "asin": "B004AHBBPW", "reviewerName": "Abby Craig", "helpful": [0, 0], "reviewText": "The best part of this app is that you can listen to free podcasts or sermons. I love hearing Joel Osteen so this is my fav feature.", "overall": 5.0, "summary": "I like being able to listen to sermons on here", "unixReviewTime": 1389398400, "reviewTime": "01 11, 2014"}
{"reviewerID": "A2R2MAYHN4F7GU", "asin": "B004AHBBPW", "reviewerName": "Alexis", "helpful": [0, 0], "reviewText": "Every morning I wake up to an inspirational bible verse. It helps me clear my mind before a long day. I can save the verses also if I want to refer back to them in troubling times. It even works without an internet connection somehow. I was on a cruise with no internet or mobile data and i STILL received my verses. Such a blessing!", "overall": 5.0, "summary": "Start the day right", "unixReviewTime": 1377475200, "reviewTime": "08 26, 2013"}
{"reviewerID": "A2UDHBWX0GPCPN", "asin": "B004AHBBPW", "reviewerName": "Alison Gill", "helpful": [0, 0], "reviewText": "It is so nice to have the Bible at your disposal. I love the reading plans and well as the fact that it can be read to you.", "overall": 5.0, "summary": "Bible reader", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "AW5YKR2WH2KVX", "asin": "B004AHBBPW", "reviewerName": "amanda hinshaw", "helpful": [0, 0], "reviewText": "Remove", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A37WP9JXJ5XSC1", "asin": "B004AHBBPW", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Wish that It was easier to navigate in but for the most part a great app for the Bible.  Praise God", "overall": 4.0, "summary": "The Bible", "unixReviewTime": 1360108800, "reviewTime": "02 6, 2013"}
{"reviewerID": "AZRTCDO8S6V4U", "asin": "B004AHBBPW", "reviewerName": "Amazon Customer", "helpful": [1, 1], "reviewText": "Clean, simple, easy to use. Daily verse, choice of Bible version, devotionals and pod casts. Would recommend to anyone! A real blessing!", "overall": 5.0, "summary": "very nice!", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
{"reviewerID": "A2RXBNM3QPHJD4", "asin": "B004AHBBPW", "reviewerName": "angiebc", "helpful": [0, 0], "reviewText": "I first downloaded it on my cell phone. Enjoyed it so much I've recently downloaded it on my Kindle. I enjoy the daily verse as well as the other features it offers.", "overall": 5.0, "summary": "Geat App!", "unixReviewTime": 1357257600, "reviewTime": "01 4, 2013"}
{"reviewerID": "A20RILBV58QORD", "asin": "B004AHBBPW", "reviewerName": "A. Pietri", "helpful": [0, 0], "reviewText": "I wish this had more versions. I love the daily verses and the ease of checking it but I like more background and history on the Word.", "overall": 3.0, "summary": "Good but no history", "unixReviewTime": 1361923200, "reviewTime": "02 27, 2013"}
{"reviewerID": "A19NPV406NQY1F", "asin": "B004AHBBPW", "reviewerName": "B. Brown", "helpful": [0, 0], "reviewText": "I downloaded the bible app for my kindle fire and I also have it on my phone. The app is so great! I dont have any problems with anything. I love listening to the podcast. Joyce Meyer is my favorite.", "overall": 5.0, "summary": "Amazing bible app", "unixReviewTime": 1338595200, "reviewTime": "06 2, 2012"}
{"reviewerID": "A2834IANCITL7X", "asin": "B004AHBBPW", "reviewerName": "Beverly B. Sloan", "helpful": [1, 1], "reviewText": "I enjoy my Daily Bible as I enjoy reading a verse when I firstopen my cell phone in the morning.  I find it very inspirational.", "overall": 5.0, "summary": "Bible", "unixReviewTime": 1395360000, "reviewTime": "03 21, 2014"}
{"reviewerID": "A1WVYWE8IG9EIX", "asin": "B004AHBBPW", "reviewerName": "Bondo", "helpful": [0, 0], "reviewText": "Thank you for the DAILY BIBLE, JoanSoft.....  I now start my day with listening to the DailyVerse.  I am a religious person but not to the extreme.  Listening to the DailyVerse reminds me of my days in grade school when we started the day off by reading from the Bible. It didn't hurt anyone and I know it helped me.  Thanks again for a great app.", "overall": 5.0, "summary": "Old Time Memories", "unixReviewTime": 1366243200, "reviewTime": "04 18, 2013"}
{"reviewerID": "A39X88W9MVXB1J", "asin": "B004AHBBPW", "reviewerName": "calmedcooled", "helpful": [0, 0], "reviewText": "Great app. I enjoy seeing the random daily verses.  The podcasts are the best.  One of my favorite evangelists, Joyce Meyer, is on there.", "overall": 5.0, "summary": "Awesome. Inspirational. Reflecting.", "unixReviewTime": 1358121600, "reviewTime": "01 14, 2013"}
{"reviewerID": "A22S9JW4YAPEAP", "asin": "B004AHBBPW", "reviewerName": "Catarina73", "helpful": [0, 0], "reviewText": "Very versatile app for daily reading of the bible.  Different reading plans offered.  Helps me work on my daily reading.  I like the fact that I don't have to carry around a paper copy book!", "overall": 5.0, "summary": "versatile app for daily reading of the bible", "unixReviewTime": 1337817600, "reviewTime": "05 24, 2012"}
{"reviewerID": "A2UL1FLFZX1HZ7", "asin": "B004AHBBPW", "reviewerName": "cherry", "helpful": [2, 2], "reviewText": "unless you are connected you will not be able to read the Bible. I did like the daily verse of the day. There are also many different versions of the bible that you can choose to read from when you are connected to the internet.", "overall": 3.0, "summary": "YOU NEED INTERNET CONNECTION !!!", "unixReviewTime": 1364083200, "reviewTime": "03 24, 2013"}
{"reviewerID": "A1H4IVXNXWWBLV", "asin": "B004AHBBPW", "reviewerName": "Chilehead Photography \"Captured Moments are t...", "helpful": [96, 107], "reviewText": "This app is great!  It has a daily verse, a daily reading plan and then a whole list of daily devotionals, both audio and written.  I usually check out the Our Daily Bread audio podcast from here instead of going to odb.org and read My Utmost for His Highest (no longer available! :-( But still appears in list for some reason).  There is also a place to seach the bible by verse or keyword.  Many of the popular versions are available including NIV, NKJV and NASB.  Is exactly what is says... a Daily Bible!  Thanks for this app!", "overall": 5.0, "summary": "Great resource with alot at your fingertips! (update)", "unixReviewTime": 1300924800, "reviewTime": "03 24, 2011"}
{"reviewerID": "A15M72A7ILQ2EV", "asin": "B004AHBBPW", "reviewerName": "Chooliki", "helpful": [0, 0], "reviewText": "I am able to share and send devotions to my friends of many different speakers. Also you can find many different types of devotions with different versions of the Bible. Love it.", "overall": 5.0, "summary": "Great. Packed with many different devotions.", "unixReviewTime": 1382745600, "reviewTime": "10 26, 2013"}
{"reviewerID": "A3173BUN91R8RF", "asin": "B004AHBBPW", "reviewerName": "Chris St Pierre", "helpful": [2, 2], "reviewText": "What a refreshingly wonderful app. There is so much content out there that to have it all mailed to me would be overwhelming. Thanks to these wonderful people I have been able to expand my spiritual walk to measures unknown to me. My eyes have been opened to revelations and deep understanding that otherwise I had been ignorant to. By having and using this app my daily morning study gets me ready for the day and keeps my heart in tune with God.It is customizable to which content I decide to read and listen to. Because of the audio portion my spiritual walk has encountered a new path of what can only be described as an old friend. That is how he will make you feel after just a short listen. I am talking about Pastor McGee and his TTB Bible radio program. It is a five year journey through the entire Bible and no one has been able to explain it as he has.McGee has a unique view into the word of God and looking back he was indeed at the beginning movement of the Christian non denominational faith. He saw the way had been opened and how chains of hierarchy and rules of the old establishment were being abandoned.He is only one of many podcasts that are available, from daily to old sermons to modern convention speeches. Rick Warren has a spot there as well as Joyce Meyers and so many others.Daily reading plans and so many wonderful features.I have gained so much for so long that some time back I became a regular supporter  of their ministry for it is with these works that many are being baptized in the Holy Spirit.", "overall": 5.0, "summary": "Outstanding", "unixReviewTime": 1364083200, "reviewTime": "03 24, 2013"}
{"reviewerID": "A1QKU0PA9VYSFL", "asin": "B004AHBBPW", "reviewerName": "Christine Pierce", "helpful": [1, 1], "reviewText": "This isn't a bad ap, but I prefer Our Daily Bread and Daily Bible Devotion better.  I do read it once in a while.", "overall": 3.0, "summary": "Devotion", "unixReviewTime": 1363651200, "reviewTime": "03 19, 2013"}
{"reviewerID": "A2AELP5F59JLQG", "asin": "B004AHBBPW", "reviewerName": "C. Scilley \"Love to read\"", "helpful": [1, 2], "reviewText": "This app is a really worth getting if you love the Bible as I do.  It has a lot of great features.", "overall": 5.0, "summary": "Love this app", "unixReviewTime": 1339459200, "reviewTime": "06 12, 2012"}
{"reviewerID": "A33H5DIDZFGYYS", "asin": "B004AHBBPW", "reviewerName": "C. Stanley", "helpful": [0, 0], "reviewText": "ONLY i wish it was in other versions, like the ESV, and the NKJV ~ but this is a great study/read!", "overall": 5.0, "summary": "Love", "unixReviewTime": 1392249600, "reviewTime": "02 13, 2014"}
{"reviewerID": "A1NK5N4PPFBMO4", "asin": "B004AHBBPW", "reviewerName": "Danielle", "helpful": [0, 0], "reviewText": "It gives you an update everyday on any verse it's kinda like the verse of the day.If you want it to read to you it will.If you get distracted a lot just  put in your ear-buds and listen to it.", "overall": 4.0, "summary": "Great", "unixReviewTime": 1370822400, "reviewTime": "06 10, 2013"}
{"reviewerID": "A1R6YNQW8W1YQ1", "asin": "B004AHBBPW", "reviewerName": "David Elenbaas", "helpful": [0, 0], "reviewText": "It is good but I was looking for more.I could be what you need so give it a try.", "overall": 3.0, "summary": "good", "unixReviewTime": 1391904000, "reviewTime": "02 9, 2014"}
{"reviewerID": "A3H4O02M0VJVML", "asin": "B004AHBBPW", "reviewerName": "Delia", "helpful": [0, 0], "reviewText": "I mostly listen to the scripture for the day.  Sometimes experience difficuly with podcasts.  Good source of reference. Pop ups to get more out of the app, can be a little annoying.", "overall": 3.0, "summary": "The Word of the Day", "unixReviewTime": 1375228800, "reviewTime": "07 31, 2013"}
{"reviewerID": "A30W7YGP3FH844", "asin": "B004AHBBPW", "reviewerName": "djw746", "helpful": [3, 4], "reviewText": "This is a great app for daily scriptures, the bible on the go, and inspiring podcasts.  There is also an audio button for those who cannot read.", "overall": 5.0, "summary": "Great mobile bible", "unixReviewTime": 1300838400, "reviewTime": "03 23, 2011"}
{"reviewerID": "AXN2MJGYO4QT6", "asin": "B004AHBBPW", "reviewerName": "D. Lewis", "helpful": [2, 2], "reviewText": "The daily Bible by joansoft is hands down the best daily Bible app on the market, ANY market. I love the fact that it is extremely easy to use. My favorite feature is the share feature allowing the user to quickly and easily share the verse of the day to any social networking site. There is quick and easy links to a whole plethora of daily devotionals helping the user to develop their walk with God on a daily basis. I love this app and I have had MANY Bible apps but none can compare to what this one offers.", "overall": 5.0, "summary": "Best Bible App Out There", "unixReviewTime": 1320192000, "reviewTime": "11 2, 2011"}
{"reviewerID": "A257VVBEMOVM9H", "asin": "B004AHBBPW", "reviewerName": "D.Songer", "helpful": [0, 0], "reviewText": "love the daily Bible verses each morning. I don't always have time to read the Bible for my Bible study group so being able to listen to the Bible or have it at my fingertips and when I have a moment is great", "overall": 4.0, "summary": "Love this app", "unixReviewTime": 1384646400, "reviewTime": "11 17, 2013"}
{"reviewerID": "A2A2E64XIULL97", "asin": "B004AHBBPW", "reviewerName": "elisha", "helpful": [0, 0], "reviewText": "ok I don't have this version of the Bible app. I have the you version but anyway I read the reviews and am totally shocked!! do some people really not know what the Bible is and think its fiction!!! I am totally blown away by this. God is very real and he is our savior he also gave us free will. so you are free to choose your path and what you believe. however he loves us all anyway and should you ever come to God he will welcome you with open arms. God bless", "overall": 5.0, "summary": "wow", "unixReviewTime": 1346544000, "reviewTime": "09 2, 2012"}
{"reviewerID": "A2BD12CY0NO0C4", "asin": "B004AHBBPW", "reviewerName": "Emmaleigh \"eeyorefive\"", "helpful": [0, 0], "reviewText": "So far this it the best Daily Bible that I've found as a free app so far.  I've only been looking for about a week but so far I really like this one.", "overall": 5.0, "summary": "Very nice!!", "unixReviewTime": 1358726400, "reviewTime": "01 21, 2013"}
{"reviewerID": "A26T6WQ5GN4DUX", "asin": "B004AHBBPW", "reviewerName": "Erin Henry", "helpful": [0, 0], "reviewText": "This app has everything you need. Daily scripture, bibles, devotionals. I look forward to it every day. I like that I can set it to come on automatically every morning.", "overall": 5.0, "summary": "My favorite bible app.", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
{"reviewerID": "A2UI4BE5U2NISG", "asin": "B004AHBBPW", "reviewerName": "Ex-Iowan", "helpful": [1, 1], "reviewText": "I really love everything about this app.  I use it all of the time.  It gives you total access to the Bible.  Works great on the Kindle Fire.  I'm spoiled.  I'd be lost without it!!!!!  I mean that.", "overall": 5.0, "summary": "Great app!!!!", "unixReviewTime": 1341446400, "reviewTime": "07 5, 2012"}
{"reviewerID": "A2FTFUIGAFL63Z", "asin": "B004AHBBPW", "reviewerName": "F. Bailey \"NYC Black Christian\"", "helpful": [0, 0], "reviewText": "Works for the most part if you're reading, but I like to listen to the Bible while driving.  It's nice that it even has audio because none of the other free bible apps I know of offer that.  My only beef is that sometimes the audio works, and sometimes it doesn't.  I guess it's not the app's fault.  Probably has something to do with the Sprint cellular network I'm on.  I would have preferred to have an option to save the files on my phone as opposed to getting them off the web every time I open it.  That way I'd have instant access to it.  I gave three stars however because despite its problems, the price is right.", "overall": 3.0, "summary": "Can be frustrating at times", "unixReviewTime": 1321401600, "reviewTime": "11 16, 2011"}
{"reviewerID": "A7PXDJVDK04HG", "asin": "B004AHBBPW", "reviewerName": "Gail Pawelski", "helpful": [0, 0], "reviewText": "This app gives me the motivation needed to meet the day.  A reading from the Good Book always puts me in the proper mind set.", "overall": 5.0, "summary": "great start to my day!", "unixReviewTime": 1367020800, "reviewTime": "04 27, 2013"}
{"reviewerID": "A39T6YAK7CW7I2", "asin": "B004AHBBPW", "reviewerName": "Garry", "helpful": [0, 0], "reviewText": "Great app for Christians. You will enjoy this app and enjoy the choices you have. One of my favorites! I love this app.", "overall": 5.0, "summary": "GREAT APP", "unixReviewTime": 1376524800, "reviewTime": "08 15, 2013"}
{"reviewerID": "A38X1YNJFR07C", "asin": "B004AHBBPW", "reviewerName": "gmalinda", "helpful": [0, 0], "reviewText": "I am using this app as part of my morning devotionals.  Perfect combination of verse, daily Bible reading, and devotional.  I have others I do, but save this for the last one as I really enjoy it!", "overall": 5.0, "summary": "love this app", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A2EO5YH6CWK5V8", "asin": "B004AHBBPW", "reviewerName": "goats", "helpful": [0, 0], "reviewText": "best biible app ever hay finallyvvvhhhjhhjjnnn b b b b b b b b b bjbbnbn nbn. n. Nb. j. b", "overall": 5.0, "summary": "awesome", "unixReviewTime": 1355356800, "reviewTime": "12 13, 2012"}
{"reviewerID": "A529YUMB096DX", "asin": "B004AHBBPW", "reviewerName": "Good Grief \"-JJ\"", "helpful": [2, 2], "reviewText": "I use a different bible for scriptures. However this one has insightful scriptures for my wife and I to talk about and the daily plan that we can read during the day and talk about later. this app has helped is to be more insistent with reading the bible and praying together.", "overall": 5.0, "summary": "handy daily tool", "unixReviewTime": 1300838400, "reviewTime": "03 23, 2011"}
{"reviewerID": "A2AL153DLI4QLA", "asin": "B004AHBBPW", "reviewerName": "Inez Abrams", "helpful": [0, 0], "reviewText": "This App is important to me because I can cross references it with my study Bible. It is a great App.", "overall": 5.0, "summary": "Daily Bible", "unixReviewTime": 1368403200, "reviewTime": "05 13, 2013"}
{"reviewerID": "A2VFH4B596XTTU", "asin": "B004AHBBPW", "reviewerName": "Jacquelyn George", "helpful": [0, 0], "reviewText": "The Daily bible give me a verse to read and easy way to get to other chapters and verses.  It even let me read different bible version.", "overall": 5.0, "summary": "I look forward to daily verses, when I wake up each morning", "unixReviewTime": 1368489600, "reviewTime": "05 14, 2013"}
{"reviewerID": "A24AAHG9B52FH8", "asin": "B004AHBBPW", "reviewerName": "Jenal", "helpful": [0, 0], "reviewText": "There's Always Time for the Daily Bible.  I like this product because it's right there at your finger tips. Great!", "overall": 5.0, "summary": "DAILY BIBLE ... WHERE/HOW CAN YOU GO WRONG WITH THE BIBLE?!? It's right there at your fingertips!", "unixReviewTime": 1386806400, "reviewTime": "12 12, 2013"}
{"reviewerID": "A2DFUPV72KQDE7", "asin": "B004AHBBPW", "reviewerName": "Jenny J. \"Jenny J.\"", "helpful": [2, 4], "reviewText": "This app was actually very stupid and very boring.  Unless I missed something, its nothing but a blank screen with one verse written down.  You can't really do to much more then read the one small passage.  I deleted it after about a week.", "overall": 1.0, "summary": "Boring", "unixReviewTime": 1369008000, "reviewTime": "05 20, 2013"}
{"reviewerID": "A1WJ7JPOAGDK0R", "asin": "B004AHBBPW", "reviewerName": "Kari \"Kari\"", "helpful": [0, 0], "reviewText": "I really love this app!  It's a nice way to have a daily scripture to ponder over.  There is also the option for more in depth scripture study which I also love.  I truly look forward to checking this app daily and it has added another nice source to help grow in my faith daily.", "overall": 5.0, "summary": "Wonderful app", "unixReviewTime": 1384041600, "reviewTime": "11 10, 2013"}
{"reviewerID": "A2FLTX6O3FF78H", "asin": "B004AHBBPW", "reviewerName": "K. Hamilton", "helpful": [1, 1], "reviewText": "I love waking up each day to a bible verse.  You have the opportunity to save verses creating a type of \"favorite list.\". You can look up verses in full context and in different Bible versions.  There are other features, and the app works great on any phone I've ever had.", "overall": 5.0, "summary": "Terrific", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "A23DXQZ4E2WGQ", "asin": "B004AHBBPW", "reviewerName": "kim Lopez", "helpful": [0, 0], "reviewText": ", Also has a share info port on screen to send same to family & friends.  I love that you can read whatever version you want,The writing is easy read.. Good Job!!!", "overall": 5.0, "summary": "Great for daily scriptures on the go.", "unixReviewTime": 1365724800, "reviewTime": "04 12, 2013"}
{"reviewerID": "A1OP2Q163JD5TP", "asin": "B004AHBBPW", "reviewerName": "KINDLE NUT", "helpful": [0, 0], "reviewText": "I have been trying to find a really good Bible plan. Well I did.  I listen with the audio and it is fantastic.  Finally something I know I will stick to. This plan gives me devotionals, preaching and Bible reading.  I can hardly wait until tomorrow for the next reading.  :-)", "overall": 5.0, "summary": "Great Bible Plan", "unixReviewTime": 1360800000, "reviewTime": "02 14, 2013"}
{"reviewerID": "AHYU3HZC09INS", "asin": "B004AHBBPW", "reviewerName": "Kiwi", "helpful": [1, 1], "reviewText": "Thank you for providing an app that not only has a daily Bible verse but other preachers as well. Thank You", "overall": 5.0, "summary": "Great Read", "unixReviewTime": 1400112000, "reviewTime": "05 15, 2014"}
{"reviewerID": "A2JF13Z3H7009U", "asin": "B004AHBBPW", "reviewerName": "K. Kurtz \"weary traveler\"", "helpful": [1, 1], "reviewText": "So many days I've been comforted and encouraged by this app! The customization options for study are terrific. If what you want is supplemental to your time in the Word, this app cannot be beaten!", "overall": 5.0, "summary": "Food for my soul!", "unixReviewTime": 1373414400, "reviewTime": "07 10, 2013"}
{"reviewerID": "ACFEJQ10MK905", "asin": "B004AHBBPW", "reviewerName": "Lady_Gforce", "helpful": [0, 0], "reviewText": "I get to listen to different messages from a long list of preachers from Joel Olsteen, Joyce Meyer and Creflo Dollar. It is a spiritual tool I tap into more than once a day. This app also allows me to search chapters or verse and it can be read to me which is hard to find (in a human sounding voice)  .THIS IS MY GO TO APP FOR PODCASTS.", "overall": 5.0, "summary": "daily devotional is great.", "unixReviewTime": 1372723200, "reviewTime": "07 2, 2013"}
{"reviewerID": "A1Y1IE41K2NDT1", "asin": "B004AHBBPW", "reviewerName": "lcajuns", "helpful": [0, 0], "reviewText": "Use this app nearly every day. I enjoy reading it and sometimes listening to the audio version. Handy to have many translations.", "overall": 5.0, "summary": "Great take along Bible", "unixReviewTime": 1389830400, "reviewTime": "01 16, 2014"}
{"reviewerID": "A3VCEVGA8DWMF5", "asin": "B004AHBBPW", "reviewerName": "Lillian Genaux", "helpful": [0, 0], "reviewText": "It's god work. enjoy not only able to read it but listen to the word too. Very good excellent book", "overall": 5.0, "summary": "Daily Bible", "unixReviewTime": 1360713600, "reviewTime": "02 13, 2013"}
{"reviewerID": "A3DURFM75XV494", "asin": "B004AHBBPW", "reviewerName": "Linda E DeBenedittis", "helpful": [1, 1], "reviewText": "My son loves this and uses it daily on his little Tablet.  He has learning Disabilities and cannot read well without the Tablet's help and he enjoys reading (or having the Bible read to him daily!", "overall": 5.0, "summary": "Used by my son!", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
{"reviewerID": "A3OLWJ8A3AP7Q9", "asin": "B004AHBBPW", "reviewerName": "Love2Read", "helpful": [0, 0], "reviewText": "I have this on both my phone and Kindle Fire HD. I use it more on my phone. It requires WiFi or Internet, which makes it more usable on my phone. I love getting the verse everyday. I can search and read devotionals as well. It is a really nice app for on the go purposes.", "overall": 5.0, "summary": "Wonderful Daily Bible Verse", "unixReviewTime": 1377216000, "reviewTime": "08 23, 2013"}
{"reviewerID": "A7NGRREQ08GOA", "asin": "B004AHBBPW", "reviewerName": "Margie", "helpful": [0, 0], "reviewText": "I am busy 24/7.  I am embarrassed to admit my quite time with God at times is less than 5 minutes a morning.  On those days this app comes in handy.  Also, some days I need a pick-me-up and this works every time.  I like how I can choose the version (NIV KJ NKJ etc)", "overall": 5.0, "summary": "Great for devotion on the go", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
{"reviewerID": "A08839553NG2E57YWLLVC", "asin": "B004AHBBPW", "reviewerName": "Martin", "helpful": [0, 0], "reviewText": "What a great blessing to have this to read each morning, each and everyday Gods Word right on my kindle, and different versions great work, t hank you thank you!!!", "overall": 5.0, "summary": "great blessing", "unixReviewTime": 1383177600, "reviewTime": "10 31, 2013"}
{"reviewerID": "A1FENMNIPDVJ42", "asin": "B004AHBBPW", "reviewerName": "Melissa C.", "helpful": [0, 1], "reviewText": "I didn't like that you could select a version for you daily verse, but the daily reading defaults back to ESV, and you can't change it. I deleted it within a few minutes", "overall": 1.0, "summary": "Deleted it", "unixReviewTime": 1390521600, "reviewTime": "01 24, 2014"}
{"reviewerID": "A2OA3NYSMBS1GM", "asin": "B004AHBBPW", "reviewerName": "M. Guru", "helpful": [0, 0], "reviewText": "This app allows you to read the Bible, receive daily devtionals, and daily scriptures in the most commonly used Bible version (atleast by me) NLT, NKJV, and KJV. You also get to listen to podcast by today's leading ministries ex: Joyce Meyer, Joel Osteen, Charles Stanley and etc.", "overall": 5.0, "summary": "Awsome App", "unixReviewTime": 1361664000, "reviewTime": "02 24, 2013"}
{"reviewerID": "AVLQ8D3PTBKZF", "asin": "B004AHBBPW", "reviewerName": "Missy", "helpful": [0, 0], "reviewText": "I love how it reminds me every morning to read my daily verse. I really love it!!!!!!!!!!!!!!!! This Bible is made for every type of Christian.", "overall": 5.0, "summary": "Daily Bible", "unixReviewTime": 1369699200, "reviewTime": "05 28, 2013"}
{"reviewerID": "A343J5M13FIY12", "asin": "B004AHBBPW", "reviewerName": "Mommato5", "helpful": [0, 0], "reviewText": "I love this app. My favorite part is getting the reminder for the daily Bible verse in the morning. I also like being able to hear the scriptures, so if I don't have time to sit and read, I can be listening to God's Word!", "overall": 5.0, "summary": "keep The Word by you", "unixReviewTime": 1366848000, "reviewTime": "04 25, 2013"}
{"reviewerID": "ACOM2CL2297RS", "asin": "B004AHBBPW", "reviewerName": "MrmsHaynes \"Mr Ms Haynes\"", "helpful": [0, 0], "reviewText": "I love this app. I have no complaints, and I didnt have any complications with this app, very easy and simple to understand. I love reading the bible where ever I go.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1360540800, "reviewTime": "02 11, 2013"}
{"reviewerID": "A18FY8U26392XL", "asin": "B004AHBBPW", "reviewerName": "MsK", "helpful": [0, 0], "reviewText": "I liked the Daily verse option.  However, the DailyPlan was hard to follow.  It does the job...I will keep it.  I am back to using my hands-on Bible though.", "overall": 3.0, "summary": "Everyday in the Word", "unixReviewTime": 1375747200, "reviewTime": "08 6, 2013"}
{"reviewerID": "A36YFLNMZM4YGP", "asin": "B004AHBBPW", "reviewerName": "Nia Adero", "helpful": [0, 0], "reviewText": "GET THIS APP!  If you desire to gain more knowledge about the Bible and to be able to do it on a daily basis, I would highly recommend this app because it keeps you on track and you can both read and listen to it either at home or in your car.  This is an awesome app also because it has several great features that make it better than other similar apps.  Unfortunately, you can't get this app for the Apple system, but if you have a Kindle or Android you are set.  I highly recommend it!", "overall": 5.0, "summary": "Daily Bible", "unixReviewTime": 1371945600, "reviewTime": "06 23, 2013"}
{"reviewerID": "A2KUNWFLNUU3Y7", "asin": "B004AHBBPW", "reviewerName": "nomadheart", "helpful": [0, 0], "reviewText": "It's a good app. You do not need an internet connection to use it or to get the verse of the day, which is cool, but it would be nice if you could highlight (like you can a kindle book) but other than that, a good app.", "overall": 4.0, "summary": "good app, don't need an internet connection to get verse of the day, can't highlight though", "unixReviewTime": 1357776000, "reviewTime": "01 10, 2013"}
{"reviewerID": "A29DAEMSXWODX6", "asin": "B004AHBBPW", "reviewerName": "O G \"oghennylo\"", "helpful": [2, 2], "reviewText": "I listen to this app all the time especially the devotions where you can listen to many great podcasts. It is very easy to use and recommend it highly", "overall": 5.0, "summary": "I use it daily", "unixReviewTime": 1324771200, "reviewTime": "12 25, 2011"}
{"reviewerID": "A1VKUZ8A1GFI77", "asin": "B004AHBBPW", "reviewerName": "Patrice Morrison", "helpful": [0, 0], "reviewText": "quick and easy to get to on my laptop. great for in a rush adn on the go love it", "overall": 5.0, "summary": "awsome", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
{"reviewerID": "A1TNP7JCB7ZCGO", "asin": "B004AHBBPW", "reviewerName": "Phyllis Hildebrand", "helpful": [0, 0], "reviewText": "I love it.  What else can I say.  Getting God's word every day, even from a tablet is the best.", "overall": 5.0, "summary": "Wonderful", "unixReviewTime": 1392508800, "reviewTime": "02 16, 2014"}
{"reviewerID": "A2DWN2MQYWKGNX", "asin": "B004AHBBPW", "reviewerName": "PinkieFairy", "helpful": [0, 2], "reviewText": "The app is a good app however it was not good for what I needed the app for. It might wrk for other people's needs.", "overall": 3.0, "summary": "Daily Bible", "unixReviewTime": 1352073600, "reviewTime": "11 5, 2012"}
{"reviewerID": "A5SICA8R9FRKH", "asin": "B004AHBBPW", "reviewerName": "punk360", "helpful": [0, 0], "reviewText": "I so love this app.I have been looking for a book that will help me memorize Bible verses easily without having to look at a page full of words. I give this app 5 stars easily.", "overall": 5.0, "summary": "love it", "unixReviewTime": 1342310400, "reviewTime": "07 15, 2012"}
{"reviewerID": "A30PY2LKV83CKX", "asin": "B004AHBBPW", "reviewerName": "Railfarmer", "helpful": [0, 0], "reviewText": "I was looking for an app to help me with my annual &#34;read through the Bible in a year&#34; and this app is perfect.  I really like the way it offers several different plans (since I like to do it a different way each year).  Plus with this app there are daily messages (in your choice of lots of translations!), and practically all of it can be read aloud to you.  This is an excellent Bible app.", "overall": 5.0, "summary": "This has it all", "unixReviewTime": 1358640000, "reviewTime": "01 20, 2013"}
{"reviewerID": "A1OCY3O072SHXH", "asin": "B004AHBBPW", "reviewerName": "Rasha", "helpful": [0, 0], "reviewText": "I have this downloaded on my Kindle Fire and use it in church, it is so much easier to go to the different books of the bible", "overall": 5.0, "summary": "Daily Bible", "unixReviewTime": 1364515200, "reviewTime": "03 29, 2013"}
{"reviewerID": "A7X8EPSXRJTK2", "asin": "B004AHBBPW", "reviewerName": "RAS", "helpful": [0, 0], "reviewText": "There are so many different options. You can read a verse or listen to a podcast or even just read the Bible. Looking up verses is a cinch. There is also an option for audio. Great app,  just genius!!!!!", "overall": 5.0, "summary": "Best daily devotion ever!!!!", "unixReviewTime": 1334880000, "reviewTime": "04 20, 2012"}
{"reviewerID": "A2OQN8YLOIOWHW", "asin": "B004AHBBPW", "reviewerName": "Renny", "helpful": [0, 0], "reviewText": "I like the fact that it has audio as well and that I can read the daily plan in different versions.  I recommended this to my brother who has macular degeneration in both eyes and he thoroughly enjoys it as well.", "overall": 5.0, "summary": "I love it!", "unixReviewTime": 1389830400, "reviewTime": "01 16, 2014"}
{"reviewerID": "A3O2S5D3F6R1E3", "asin": "B004AHBBPW", "reviewerName": "richard gomez", "helpful": [0, 0], "reviewText": "Great app!!!! I use it alot since I've had it..I just don't think there's any other app out there that has it all......!!!", "overall": 5.0, "summary": "\"Good Job\"", "unixReviewTime": 1385683200, "reviewTime": "11 29, 2013"}
{"reviewerID": "A1UDL0MEOR280L", "asin": "B004AHBBPW", "reviewerName": "Richie B.", "helpful": [0, 0], "reviewText": "This app allows you to read and listen to the word during your devotions on a daily basis. While moving around or in one place you can listen to your favorite pastor sharing messages.  Your can listen anywhere and really immerse yourself in the word so that you enhance your understanding of the bible.Don't take my word for it. Try it out yourselves.", "overall": 5.0, "summary": "Great for the busy person", "unixReviewTime": 1383004800, "reviewTime": "10 29, 2013"}
{"reviewerID": "A2UTBD3OBHQ9S9", "asin": "B004AHBBPW", "reviewerName": "Rod", "helpful": [0, 0], "reviewText": "This is one of the best Apps going for a daily bible guide that works well on the Kindle Fire. It is easy to start and has links that are just as easy to use for further depth if you want to pursue a topic. I really like it.", "overall": 5.0, "summary": "Excellent", "unixReviewTime": 1382054400, "reviewTime": "10 18, 2013"}
{"reviewerID": "A183THTONNNESL", "asin": "B004AHBBPW", "reviewerName": "R. Watson \"public health diva\"", "helpful": [0, 0], "reviewText": "I love this app. It has a lot of variety to it in the way of speakers or podcasts, scripture verses and everything.", "overall": 5.0, "summary": "Great app!", "unixReviewTime": 1373155200, "reviewTime": "07 7, 2013"}
{"reviewerID": "A1RSANUDWRO7RB", "asin": "B004AHBBPW", "reviewerName": "Ryan DeMesa", "helpful": [3, 6], "reviewText": "this app works great. u can schedule it to give u one inspirational verse per day as well as choose what translation u want showing on the widget.", "overall": 5.0, "summary": "ignore those who rate this app one star to simply hate and bash religion. this app is great.", "unixReviewTime": 1300752000, "reviewTime": "03 22, 2011"}
{"reviewerID": "A9WFV9DEWY4S0", "asin": "B004AHBBPW", "reviewerName": "S. DAY \"S M DAY\"", "helpful": [0, 0], "reviewText": "Pretty good Bible app if you have internet service.  Some of the information you may need to look up May not display if you are not connected online.  This is the first Bible app I tried, it is often difficult to manipulate the search engine.I have since found a much better Bible app in my opinion and much more user friendly but maybe someone might like this better.  This app just did not work for me.", "overall": 3.0, "summary": "Not For Me", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "A2ATVYD91DT40L", "asin": "B004AHBBPW", "reviewerName": "silverlistener", "helpful": [0, 0], "reviewText": "Getting the daily verses are good.  Some days it hits home for that day.  Being able to find verses so quickly is wonderful.  I am still a hunter for some of the books of the Bible.", "overall": 5.0, "summary": "Daily verses", "unixReviewTime": 1369180800, "reviewTime": "05 22, 2013"}
{"reviewerID": "A5T4UD17XHEDV", "asin": "B004AHBBPW", "reviewerName": "Soccer Mom", "helpful": [0, 0], "reviewText": "So uplifting to get a bible verse on a daily basis.  Love the access to look up information when needed for bible study and the ability to have it read to you is a great feature.", "overall": 5.0, "summary": "Uplifting", "unixReviewTime": 1370217600, "reviewTime": "06 3, 2013"}
{"reviewerID": "A1OO6NIYPAZHH4", "asin": "B004AHBBPW", "reviewerName": "sonidorm", "helpful": [0, 0], "reviewText": "I am really enjoying this app.  I like the daily plan as it covers passages from different books; also the devotional podcasts. This is my third Bible app. and I put this at the top of the list.Recommend it to everyone", "overall": 5.0, "summary": "Daily Bible", "unixReviewTime": 1353801600, "reviewTime": "11 25, 2012"}
{"reviewerID": "A26EFYSDYDW92O", "asin": "B004AHBBPW", "reviewerName": "Talya", "helpful": [0, 0], "reviewText": "This app was awesome, but the Daily Plan went blank, and has not been fixed. it doesn't matter which plan you are on. I tried going to the website, but joansoft.com is totally down. Looks like the domain may have expired. Does that mean things won't get fixed? Help!", "overall": 3.0, "summary": "Please fix!", "unixReviewTime": 1336521600, "reviewTime": "05 9, 2012"}
{"reviewerID": "ATQ8DTTRJEQ8G", "asin": "B004AHBBPW", "reviewerName": "Teresa Dailey", "helpful": [0, 0], "reviewText": "very straightforward, easy to use, plus the Daily Devotion are real time and up to date.With Joyce Meyer, Joel Olsten any other . The I like is from joyce Meyer's New book God's not mad at you.", "overall": 5.0, "summary": "Excellent App.", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}
{"reviewerID": "A84Z17TJMDRW6", "asin": "B004AHBBPW", "reviewerName": "Terry", "helpful": [0, 0], "reviewText": "I like this app.  It sends a reading to you each day, it will read the verse to you if connected.  Tabs include: Daily Plan ( various longer Bible verses that can be read to you), Devotion tab (recordings of various speaker talks on different subjects), and a final Search tab (you can enter a book, chapter and verse and it will come up).  This is a very useful and  very friendly app.", "overall": 5.0, "summary": "I use this app daily", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "A30JYEX8DVTK3Q", "asin": "B004AHBBPW", "reviewerName": "theosdoren", "helpful": [1, 1], "reviewText": "A Word each day from God's Word and so much more! It's free like Jesus frees a man from his sin.", "overall": 5.0, "summary": "A Word each day from God's Word and so much more", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"}
{"reviewerID": "A2WT86IPK92CM0", "asin": "B004AHBBPW", "reviewerName": "Thomas Adams", "helpful": [2, 2], "reviewText": "first thing I would like to do is to thank amazon for putting the Bible and Christian readings on the amazon fire.ienjoy the daily Bible because of the daily readings. everyone should have it installed on their kindle fire .thanks Tommy adams", "overall": 5.0, "summary": "daily bible", "unixReviewTime": 1327449600, "reviewTime": "01 25, 2012"}
